### Terraform Plan for Stage 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.app.module.cloudfront_ssr.aws_acm_certificate.cloudfront must be replaced
+/- resource "aws_acm_certificate" "cloudfront" {
      ~ arn                       = "arn:aws:acm:us-east-1:339713113237:certificate/3a1cc7fb-1e7d-41b9-939c-3402e07149b8" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "designmanual.stage.vylabs.io"
              - resource_record_name  = "_2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_db86bc4f553f2925c8ec2b319cae1b4f.xlfgrmvvlj.acm-validations.aws."
            },
          + {
              + domain_name           = "designmanual.stage.vylabs.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "stage.design.vy.no"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:339713113237:certificate/3a1cc7fb-1e7d-41b9-939c-3402e07149b8" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-11-12T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-10-14T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "stage.design.vy.no",
            # (1 unchanged element hidden)
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate_validation.cloudfront must be replaced
-/+ resource "aws_acm_certificate_validation" "cloudfront" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:339713113237:certificate/3a1cc7fb-1e7d-41b9-939c-3402e07149b8" -> (known after apply) # forces replacement
      ~ id                      = "2025-10-14 12:59:11.022 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.app.module.cloudfront_ssr.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                         = [
          + "stage.design.vy.no",
            # (1 unchanged element hidden)
        ]
        id                              = "E1QEGTKX2K9D0J"
        tags                            = {}
        # (23 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:339713113237:certificate/3a1cc7fb-1e7d-41b9-939c-3402e07149b8" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["designmanual.stage.vylabs.io"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn                             = "_2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io" -> (known after apply)
      ~ id                               = "Z091299017AL6BP0WEP6W__2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_db86bc4f553f2925c8ec2b319cae1b4f.xlfgrmvvlj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["stage.design.vy.no"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z091299017AL6BP0WEP6W"
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cloudfront_alias["stage.design.vy.no"] will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "stage.design.vy.no"
      + type            = "A"
      + zone_id         = "Z091299017AL6BP0WEP6W"

      + alias {
          + evaluate_target_health = false
          + name                   = "dmlx0eoq2xrsw.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.replacement["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "replacement" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:339713113237:listener-rule/app/common-services-alb-alb/68013d1e868afe73/40b90bdc4b91ae7c/a5163c3d0fa3e924"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "designmanual.stage.vylabs.io",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "designmanual.stage.vylabs.io",
                  + "stage.design.vy.no",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.service["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "service" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:339713113237:listener-rule/app/common-services-alb-alb/68013d1e868afe73/9ba7a735a3186a57/5f573fafcb48022c"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "designmanual.stage.vylabs.io",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "designmanual.stage.vylabs.io",
                  + "stage.design.vy.no",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 3 to change, 3 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 1b71b1d0bcc4be5539fa15d474e06a7e90580b08*
*Plan generated at: 2025-10-20 14:08:58 UTC*
